examples/render_all_grammars/dot/tests_functional_test_scoping_components_model2_Components.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


39856472[ label="{Model|}"]

39939208[ label="{Package|+name:ID\l}"]

39959928[ label="{Component|+name:ID\l}"]

40024824[ label="{*Slot|}"]

39929368[ label="{SlotIn|+name:ID\l}"]

39934904[ label="{SlotOut|+name:ID\l}"]

40043320[ label="{Instance|+name:ID\l}"]

40048856[ label="{Connection|}"]

40054392[ label="{FQN|FQN}"]

40059928[ label="{Comment|\\/\\/.*$}"]

39949096[ label="{ID|}"]

39908632[ label="{STRING|}"]

39796792[ label="{BOOL|}"]

39993272[ label="{INT|}"]

40000088[ label="{FLOAT|}"]

40005624[ label="{STRICTFLOAT|}"]

40011160[ label="{NUMBER|}"]

40016696[ label="{BASETYPE|}"]

40022232[ label="{*OBJECT|}"]



39856472 -> 39939208[arrowtail=diamond, dir=both, headlabel="packages 0..*"]
39939208 -> 39959928[arrowtail=diamond, dir=both, headlabel="components 1..*"]
39939208 -> 40043320[arrowtail=diamond, dir=both, headlabel="instances 1..*"]
39939208 -> 40048856[arrowtail=diamond, dir=both, headlabel="connections 1..*"]
39939208 -> 39939208[arrowtail=diamond, dir=both, headlabel="packages 1..*"]
39959928 -> 39959928[headlabel="extends "]
39959928 -> 40024824[arrowtail=diamond, dir=both, headlabel="slots 0..*"]
40024824 -> 39929368 [dir=back]
40024824 -> 39934904 [dir=back]
40043320 -> 39959928[headlabel="component "]
40048856 -> 39934904[headlabel="from_port "]
40048856 -> 40043320[headlabel="from_inst "]
40048856 -> 39929368[headlabel="to_port "]
40048856 -> 40043320[headlabel="to_inst "]
40011160 -> 40005624 [dir=back]
40011160 -> 39993272 [dir=back]
40016696 -> 40011160 [dir=back]
40016696 -> 40000088 [dir=back]
40016696 -> 39796792 [dir=back]
40016696 -> 39949096 [dir=back]
40016696 -> 39908632 [dir=back]
40022232 -> 40016696 [dir=back]

}
